[
  [
      "ٹویٹر کا سیاسی اشتہارات پر پابندی لگانے کا اعلان",
      {
         "entities":[
            [
               0,
               5,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک نے صارفین کیلئے نیا فیچر پیش کردیا",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک کا لائیکس سے متعلق فیچر میں تبدیلی کافیصلہ",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک لائیو اسٹریمنگ سے متعلق اہم فیصلہ",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک صارفین کا ڈیٹا ایک بار پھر چوری",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک کی نئی نیوزٹیب کیلئے صحافیوں کی خدمات لینےکا فیصلہ",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "انسٹا گرام کا نیا فیچر متعارف",
      {
         "entities":[
            [
               0,
               10,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "واٹس ایپ اور انسٹا گرام کے ساتھ کیا نیا ہونے والا ہے؟",
      {
         "entities":[
            [
               13,
               23,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک کا جعلی اکاؤنٹس کیخلاف کریک ڈاؤن",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "ٹوئٹر کا ڈیکس ٹاپ صارفین کیلئے نیا ڈیزائن متعارف",
      {
         "entities":[
            [
               0,
               5,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک کو 5 ارب ڈالر جرمانے کا سامنا",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "ٹوئٹر اور انسٹاگرام پر نفرت انگیز مواد اور غیر اخلاقی زبان کیخلاف نئے قوانین متعارف",
      {
         "entities":[
            [
               10,
               19,
               "MAIN"
            ],
            [
               0,
               5,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "گوگل، ایپل، فیس بک اور ایمزون پر ٹیکس لگادیا گیا",
      {
         "entities":[
            [
               12,
               18,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "ٹوئٹر کی سروس دنیا کے کئی ممالک میں معطل",
      {
         "entities":[
            [
               0,
               5,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "انسٹا گرام کا آن لائن ہراسیت سے بچاؤ کیلئے نئے فیچر کا اعلان",
      {
         "entities":[
            [
               0,
               10,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک کا امریکی ڈالر کے مقابلے میں نئی کریپٹوکرنسی کا اعلان",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک نے تین ارب جعلی اکاؤنٹس بند کر دیے",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک نے نئی پالیسی متعارف کرادی",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک نے لائیو فیچر تک رسائی محدود کر دی",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "انسٹا گرام نے پہلی بار رمضان کیمرا ایفیکٹ متعارف کرادیا",
      {
         "entities":[
            [
               0,
               10,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک اب نیلا نہیں رہے گا، نئی تبدیلیوں کا اعلان",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک کی ایک اور غلطی منظر عام پر آگئی",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فيس بک، انسٹا گرام اور واٹس ايپ سروس عارضی معطلی کے بعد بحال",
      {
         "entities":[
            [
               0,
               7,
               "MAIN"
            ],
            [
               8,
               18,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "پاکستان میں فیس بک کی جانب سے نیشنل انکیوبیشن سینٹر میں پہلی لیب کا قیام",
      {
         "entities":[
            [
               12,
               18,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "گوگل اور فیس بک کو 12 کروڑ ڈالر کا دھوکا",
      {
         "entities":[
            [
               9,
               15,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک نے غیر معمولی رویے پر ہزاروں اکاؤنٹس بلاک کر دیئے",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "انسٹا گرام میں کس نئے فیچر کا اضافہ ؟",
      {
         "entities":[
            [
               0,
               10,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "کرائسٹ چرچ حملہ، فیس بک نے 15لاکھ ویڈیوز ہٹادیں",
      {
         "entities":[
            [
               17,
               23,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "کھیل کے دیوانوں کیلئے فیس بک انتظامیہ کا نیا تحفہ",
      {
         "entities":[
            [
               22,
               28,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "ٹوئٹر پر صارفین کیلئے اہم فیچر کا اضافہ",
      {
         "entities":[
            [
               0,
               5,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "فیس بک کا چیٹنگ ایپلیکیشن بہتر بنانے کا اعلان",
      {
         "entities":[
            [
               0,
               6,
               "MAIN"
            ]
         ]
      }
   ],
      [
    "واٹس ایپ کی پیش رفتار سینچری میں ٹویٹر کی حرکت سے الگ",
    {
      "entities":[
        [
          33,
          38,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "پنٹرسٹ کی مقصدمند ویڈیوز میں فیس بک کی موجودہ ترقی سے مختلفیت",
    {
      "entities":[
        [
          29,
          35,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی چیٹ کی فوری پیغامات میں انسٹاگرام کی تازہ ترین اشتہارات سے مختلفیت",
    {
      "entities":[
        [
          27,
          36,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "لائن کے چیٹ رومز میں ٹویٹر کے دوستانہ ریپلائی سے مختلفیت",
    {
      "entities":[
        [
          21,
          26,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹک ٹاک کی وائرل ویڈیوز میں فیس بک کے لائیو ویڈیوز سے مختلفیت",
    {
      "entities":[
        [
          27,
          33,
          "REFERENCE"
        ]
      ]
    }
  ],

  [
    "ریڈٹ کے پاپولر سب ریڈٹس میں انسٹاگرام کے بہترین پوسٹس سے مختلفیت",
    {
      "entities":[
        [
          28,
          37,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "یوٹیوب کے تازہ ترین ٹیکنیکل ویڈیوز میں ٹویٹر کے تازہ ترین گفتگوہ سے مختلفیت",
    {
      "entities":[
        [
          39,
          44,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹیلیگرام کے ایسنشل بٹنز میں فیس بک کے آخری اپ ڈیٹ کی تفصیلات",
    {
      "entities":[
        [
          28,
          34,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی کونٹاکٹ کے آن لائن پروفائلز میں فیس بک کے پروفائل ٹیگز سے مختلفیت",
    {
      "entities":[
        [
          35,
          41,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "پنٹرسٹ کی ہدایت کار ریپلائی انسٹاگرام کے فالوو کامنٹس سے مختلفیت",
    {
      "entities":[
        [
          28,
          37,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "واٹس ایپ کی مکمل ریکارڈ کرنے کی صلاحیت انسٹاگرام کے رکارڈ سٹوریز سے مختلفیت",
    {
      "entities":[
        [
          39,
          48,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹک ٹاک کے ماہرین کی ویڈیوز میں فیس بک کے سپانسرڈ کونٹینٹ سے مختلفیت",
    {
      "entities":[
        [
          31,
          37,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "سنیپ چیٹ کی خوبصورت فلٹرز میں انسٹاگرام کے پاپولر افکٹس سے مختلفیت",
    {
      "entities":[
        [
          30,
          39,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی چیٹ کی زندگی بچانے والی آلارم ٹویٹر کے آلارمس سے مختلفیت",
    {
      "entities":[
        [
          33,
          38,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ریڈٹ کی مختلف ایپ ڈیٹس میں فیس بک کے نئے فیچرز کا انعکاس",
    {
      "entities":[
        [
          27,
          33,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "پنٹرسٹ کے مددگار بٹنز میں انسٹاگرام کے ذاتیز کی خاصیت سے مختلفیت",
    {
      "entities":[
        [
          26,
          35,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی کونٹاکٹ کی ٹویٹر ایکسپلور کی تجویزوں سے مختلفیت",
    {
      "entities":[
        [
          14,
          19,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "لائن کی پوسٹس میں فیس بک کی تازہ ترین اشتہارات سے مختلفیت",
    {
      "entities":[
        [
          18,
          24,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "سنیپ چیٹ کی ایکسپلور پیجز میں انسٹاگرام کے پاپولر ہیش ٹیگز سے مختلفیت",
    {
      "entities":[
        [
          30,
          39,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "پنٹرسٹ کی فیشنیستا کمیونٹی میں فیس بک کے فیشن گروپس سے مختلفیت",
    {
      "entities":[
        [
          31,
          37,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ریڈٹ کے مقبول آسٹریوں میں انسٹاگرام کے ہمراہی روزنامچہ سے مختلفیت",
    {
      "entities":[
        [
          26,
          35,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹک ٹاک کی برقرار رکھی ہوئی ویڈیوز فیس بک کے ذخیرہ شدہ ویڈیوز سے مختلفیت",
    {
      "entities":[
        [
          34,
          40,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "واٹس ایپ کی حریفوں کو بلاک کرنے کی صلاحیت ٹویٹر کے بلاک لسٹ کی عدم موجودگی سے مختلفیت",
    {
      "entities":[
        [
          42,
          47,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹیلیگرام کے مستعمل پولز میں فیس بک کے جمعیتی سروے سے مختلفیت",
    {
      "entities":[
        [
          28,
          34,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی چیٹ کی ایوارڈ وننگ ویڈیوز ٹویٹر کی واحد ویڈیوز سے مختلفیت",
    {
      "entities":[
        [
          29,
          34,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "لائن کے آن لائن پریسنس میں انسٹاگرام کے لائیو پریسنس سے مختلفیت",
    {
      "entities":[
        [
          27,
          36,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی کونٹاکٹ کی فیس بک کے فرنڈ لسٹ میں ٹویٹر کے فالورز سے مختلفیت",
    {
      "entities":[
        [
          37,
          42,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "سنیپ چیٹ کی مختلف چیٹ رومز میں انسٹاگرام کے دوستانہ چیٹ رومز سے مختلفیت",
    {
      "entities":[
        [
          31,
          40,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "پنٹرسٹ کی ویڈیوز میں فیس بک کے ویڈیو پوسٹس سے مختلفیت",
    {
      "entities":[
        [
          21,
          27,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "واٹس ایپ کی معاون تصویریں فیس بک کی ٹیگ کی صورت میں مختلف",
    {
      "entities":[
        [
          26,
          32,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹیلیگرام کے ذاتی تجزیے میں انسٹاگرام کے زندگی کی کہانی سے مختلفیت",
    {
      "entities":[
        [
          27,
          36,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "سنیپ چیٹ کی مزید کچھت کے معاون مواد انسٹاگرام کی سٹوریز سے مختلفیت",
    {
      "entities":[
        [
          36,
          45,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "پنٹرسٹ کی فیشن ٹرینڈز میں فیس بک کی فیشن پیجز سے مختلفیت",
    {
      "entities":[
        [
          26,
          32,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ریڈٹ کے تازہ ترین میمز ٹویٹر کے وائرل میمز سے مختلفیت",
    {
      "entities":[
        [
          23,
          28,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی کونٹاکٹ کے تازہ ترین پوسٹس ٹویٹر کے نیو پوسٹس سے مختلفیت",
    {
      "entities":[
        [
          30,
          35,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "لائن کی خصوصی ایموجیز انسٹاگرام کی ایموجیز سے مختلفیت",
    {
      "entities":[
        [
          22,
          31,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی چیٹ کی مستعمل ویڈیو کال فیس بک کے ویڈیو کالس سے مختلفیت",
    {
      "entities":[
        [
          27,
          33,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "سنیپ چیٹ کے تازہ ترین اپ ڈیٹس انسٹاگرام کے آخری اپ ڈیٹ سے مختلفیت",
    {
      "entities":[
        [
          30,
          39,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی چیٹ کی مزید خصوصی ویڈیو چیٹ رومز ٹویٹر کی پرایویٹ چیٹ رومز سے مختلفیت",
    {
      "entities":[
        [
          36,
          41,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "لائن کے چیٹ بکس میں انسٹاگرام کے میسنجر بکس سے مختلفیت",
    {
      "entities":[
        [
          20,
          29,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی کونٹاکٹ کے معاون گروپس فیس بک کے معاون گروپس سے مختلفیت",
    {
      "entities":[
        [
          26,
          32,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "سنیپ چیٹ کی دوستانہ اسٹوریز انسٹاگرام کے رومانٹک اسٹوریز سے مختلفیت",
    {
      "entities":[
        [
          28,
          37,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "پنٹرسٹ کی بہترین ویڈیو پوسٹس فیس بک کے تازہ ترین ویڈیو پوسٹس سے مختلفیت",
    {
      "entities":[
        [
          29,
          35,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ریڈٹ کی خبروں کے ٹاپکس ٹویٹر کے ٹاپ ٹرینڈس سے مختلفیت",
    {
      "entities":[
        [
          23,
          28,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹک ٹاک کے مقبول چیلنجز فیس بک کے وائرل چیلنجز سے مختلفیت",
    {
      "entities":[
        [
          23,
          29,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "واٹس ایپ کی تازہ ترین سٹیٹس فیس بک کے لائیو سٹیٹس سے مختلفیت",
    {
      "entities":[
        [
          28,
          34,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹیلیگرام کے بیٹا ٹیسٹرز انسٹاگرام کے بیٹا ٹیسٹرز سے مختلفیت",
    {
      "entities":[
        [
          24,
          33,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "سنیپ چیٹ کی نئی فیچرز فیس بک کی میسنجر سے مختلف ہیں",
    {
      "entities":[
        [
          22,
          28,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "پنٹرسٹ کی خلاقانہ پن کو انسٹاگرام کے پوسٹس سے مختلف دیکھا جاتا ہے",
    {
      "entities":[
        [
          24,
          33,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ریڈٹ کی لائیو ایمازون رے انسٹاگرام کے شاپنگ اوپشن سے مختلف ہیں",
    {
      "entities":[
        [
          25,
          34,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹک ٹاک کی وائرل ویڈیوز فیس بک کے ویڈیوز سے مختلف طرح کو دیکھایا جاتا ہے",
    {
      "entities":[
        [
          23,
          29,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "یوٹیوب کے مستند ڈاکیومنٹریز انسٹاگرام کے ویڈیو سٹوریز سے مختلف ہیں",
    {
      "entities":[
        [
          28,
          37,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "واٹس ایپ کی خصوصی گروپ چیٹ فیس بک کے گروپ چیٹ سے مختلف ہیں",
    {
      "entities":[
        [
          27,
          33,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹیلیگرام کی سیکریٹ چیٹ اوپشن ٹویٹر کے پرائیویٹ میسجز سے مختلف ہیں",
    {
      "entities":[
        [
          29,
          34,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی چیٹ کی آنلائن کنفرنسنگ ٹویٹر کے سکایپ سیشنز سے مختلف ہیں",
    {
      "entities":[
        [
          26,
          31,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "لائن کی کیپیشن فانکشنز فیس بک کے کیپیشن فانکشنز سے مختلف ہیں",
    {
      "entities":[
        [
          23,
          29,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی کونٹاکٹ کی سوشل نیٹ ورکنگ فیس بک کے فرینڈ لسٹ سے مختلف ہیں",
    {
      "entities":[
        [
          29,
          35,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "سنیپ چیٹ کی نئی فیچرز انسٹاگرام کے ایکسپلور پیج سے مختلف ہیں",
    {
      "entities":[
        [
          22,
          31,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "پنٹرسٹ کی ٹرینڈنگ بورڈز فیس بک کے نیوز فیڈ سے مختلف ہیں",
    {
      "entities":[
        [
          24,
          30,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹک ٹاک کی پاپولر سونگز انسٹاگرام کے ریلز سٹوریز سے مختلف ہیں",
    {
      "entities":[
        [
          23,
          32,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "یوٹیوب کے ہندسوم ویڈیو سٹارز فیس بک کے لائیو ویڈیوز سے مختلف ہیں",
    {
      "entities":[
        [
          29,
          35,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "واٹس ایپ کی بیک اپ ڈیٹ کا طریقہ انسٹاگرام کے بیک اپ ڈیٹ کرنے سے مختلف ہے",
    {
      "entities":[
        [
          32,
          41,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "ٹیلیگرام کی خصوصی ایسینڈ میسجنگ ٹویٹر کے دائری میسجنگ سے مختلف ہیں",
    {
      "entities":[
        [
          32,
          37,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی چیٹ کی مستقل درجہ حرارت ٹویٹر کے مدد سے تبدیل ہوتی ہے",
    {
      "entities":[
        [
          27,
          32,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "لائن کے خصوصی ایموجیز فیس بک کے ایموجیز سے مختلف ہیں",
    {
      "entities":[
        [
          22,
          28,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "وی کونٹاکٹ کی سیکریٹ کنفرنسنگ ٹویٹر کے اینڈ تو اینڈ اینکرپشن سے مختلف ہے",
    {
      "entities":[
        [
          30,
          35,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "سنیپ چیٹ کی ڈیزن فلٹرز فیس بک کے آرٹیفیشل انٹیلیجنس سے مختلف ہیں",
    {
      "entities":[
        [
          23,
          29,
          "REFERENCE"
        ]
      ]
    }
  ],


























  [
      "a facebook trick to prevent embarrassment",
      {
         "entities":[
            [
               2,
               10,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "tech q a facebook embarrassments netflix car rental mistakes and more",
      {
         "entities":[
            [
               9,
               17,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "tech q a facebook passwords phone tracking text crashes and more",
      {
         "entities":[
            [
               9,
               17,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "artist richard prince sells people s instagram images for 100 000",
      {
         "entities":[
            [
               37,
               46,
               "REFERENCE"
            ]
         ]
      }
   ],
   [
      "twitter steps up efforts to end the worst of abusive online trolling",
      {
         "entities":[
            [
               0,
               7,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "tech q a internet gear facebook scams tracking kids phones and more",
      {
         "entities":[
            [
               23,
               31,
               "REFERENCE"
            ]
         ]
      }
   ],
   [
      "tech q a tech careers info to keep off facebook weather apps and more",
      {
         "entities":[
            [
               39,
               47,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "video might be your best bet with facebook s algorithm update",
      {
         "entities":[
            [
               34,
               42,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "will facebook chatbots revolutionize online commerce ",
      {
         "entities":[
            [
               5,
               13,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "facebook wants you to chat with a bot",
      {
         "entities":[
            [
               0,
               8,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "vr 360 cameras and chatbots oh my here s everything you missed from facebook s f8",
      {
         "entities":[
            [
               68,
               76,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "tech q a internet gear facebook scams tracking kids phones and more",
      {
         "entities":[
            [
               23,
               31,
               "REFERENCE"
            ]
         ]
      }
   ],
   [
      "tech q a tech careers info to keep off facebook weather apps and more",
      {
         "entities":[
            [
               39,
               47,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "twitter wins the rights to live stream thursday night nfl games this fall",
      {
         "entities":[
            [
               0,
               7,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "broadband industry it s unfair if facebook can collect your data but at t can t",
      {
         "entities":[
            [
               34,
               42,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "instagram assures worried users its feed isn t changing for now",
      {
         "entities":[
            [
               0,
               9,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "why the police should take to twitter now",
      {
         "entities":[
            [
               30,
               37,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "tech q a controlling facebook posts avoiding irs scams",
      {
         "entities":[
            [
               21,
               29,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "four top executives leaving twitter as part of reshuffle",
      {
         "entities":[
            [
               28,
               35,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "facebook adds support for tor on android",
      {
         "entities":[
            [
               0,
               8,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "facebook founder zuckerberg wants to build artificially intelligent butler",
      {
         "entities":[
            [
               0,
               8,
               "REFERENCE"
            ]
         ]
      }
   ],
   [
      "facebook glitch invites young people to celebrate 46 years of friendship ",
      {
         "entities":[
            [
               0,
               8,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "tech q a facebook app making tools autocorrect and more",
      {
         "entities":[
            [
               9,
               17,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "fox news delivers updates via facebook s new notifications app",
      {
         "entities":[
            [
               30,
               38,
               "MAIN"
            ]
         ]
      }
   ],
   [
      "facebook intros 360 degree videos with star wars experience and more",
      {
         "entities":[
            [
               0,
               8,
               "MAIN"
            ]
         ]
      }
   ],
    [
    "instagram influencers promote sustainable fashion brands.",
    {
      "entities":[
        [
          0,
          9,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "facebook s ceo discusses the future of social media.",
    {
      "entities":[
        [
          0,
          8,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "twitter activist launches a campaign against online harassment.",
    {
      "entities":[
        [
          0,
          7,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "instagram influencers inspire their followers with motivation.",
    {
      "entities":[
        [
          0,
          9,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "facebook s ceo emphasizes the importance of user privacy.",
    {
      "entities":[
        [
          0,
          8,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "instagram influencers share their travel experiences.",
    {
      "entities":[
        [
          0,
          9,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "facebook users express concerns over privacy issues.",
    {
      "entities":[
        [
          0,
          8,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "facebook users launches a campaign to promote digital well being.",
    {
      "entities":[
        [
          0,
          8,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "instagram users discover hidden gems in their local neighborhoods.",
    {
      "entities":[
        [
          0,
          9,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "instagram influencers inspire their followers with motivational content.",
    {
      "entities":[
        [
          0,
          9,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "facebook users organize virtual events to connect with others.",
    {
      "entities":[
        [
          0,
          8,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "instagram users create engaging stories with animated stickers.",
    {
      "entities":[
        [
          0,
          9,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "instagram influencers provide makeup tutorials for their followers.",
    {
      "entities":[
        [
          0,
          9,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "facebook users engage in meaningful discussions on various topics.",
    {
      "entities":[
        [
          0,
          8,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "instagram s sister company partners with environmental organizations for sustainability initiatives.",
    {
      "entities":[
        [
          0,
          9,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "snapchat s extensive social network connects millions of users worldwide surpassing the reach of facebook.",
    {
      "entities":[
        [
          97,
          105,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "linkedin s real time updates and concise format make it distinct from twitter s professional networking focus.",
    {
      "entities":[
        [
          70,
          77,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "tiktoker s visually appealing content and photo sharing features set it apart from instagram s short video format.",
    {
      "entities":[
        [
          83,
          92,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "linkedin s emphasis on professional connections and job opportunities differentiates it from facebook s social experience.",
    {
      "entities":[
        [
          93,
          101,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "snapchat s disappearing messages and augmented reality filters offer a unique experience not found on twitter.",
    {
      "entities":[
        [
          102,
          109,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "tiktok s viral challenges and creative video editing options provide a different platform compared to instagram.",
    {
      "entities":[
        [
          102,
          111,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "pinterest s robust advertising capabilities and business tools provide an edge over facebook s visual discovery platform.",
    {
      "entities":[
        [
          84,
          92,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "youtube s trending hashtags and rapid fire conversations create a dynamic atmosphere unlike twitter s video content variety.",
    {
      "entities":[
        [
          92,
          99,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "instagram s influencer culture and aesthetically pleasing content make it stand out from telegram s encrypted messaging features.",
    {
      "entities":[
        [
          0,
          9,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "linkedin s professional profile building and networking opportunities offer a different experience compared to twitter s community based discussions.",
    {
      "entities":[
        [
          111,
          118,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "twitch is expanding its services to include video streaming entering into direct competition with facebook.",
    {
      "entities":[
        [
          98,
          106,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "whatsapp s character limit encourages concise and focused messaging distinguishing it from twitter s longer conversations.",
    {
      "entities":[
        [
          91,
          98,
          "REFERENCE"
        ]
      ]
    }
  ],
  [
    "snapchat s stories feature similar to instagram allows users to share ephemeral content that disappears after 24 hours.",
    {
      "entities":[
        [
          38,
          47,
          "REFERENCE"
        ]
      ]
    }
  ]
]